//////////////////////////////////
//端口定义
/////////////////////////////////////////////////////////////////////
//MFRC500
sbit     MF522_RST  =    P1^6;                   //RC500片选
sbit     MF522_NSS  =    P1^2;                   //SDA
sbit     MF522_SCK  =    P1^5;
sbit     MF522_SI   =    P1^3;
sbit     MF522_SO   =    P1^4;


/////////////////////////////////////////////////////////////////////
//函数原型
/////////////////////////////////////////////////////////////////////

void RC_init(void);
void RC_control(void);

void InitializeSystem();  // 所有引脚初始化    

void Delay(unsigned int time); 

void writek();   // 写门禁卡数据

void readk();    // 读门禁卡数据
